2n39o4/dddmf/lm3s6965-uart.c
// lm3s6965-uart.c
//
// all uart specific code goes here
//
//
// TODO: What/Why/Where is the SSI used for
// TODO: Any embedded system should run a watch-dog timer
//
// NOTES: What should I name this file.  I like the lib- part BUT the lm3s6965 is not quite
//        correct.  For a long time I thought the com1268 had an lm3s6965 when in fact it
//        is an lm3s6911.  
//
//
///////////////////////////////////////////////////////
//     6911 -> Cortex-M3 based Microcontroller:	     //
//     - 50MHz, 256KB Flash ROM, 64KB SRAM, MPU	     //
//     - 4 Timers				     //
//     - 6 Capture Compare Pins			     //
//     - Ethernet MAC + PHY			     //
//     - 3 * UART				     //
//     - 2 * I2C				     //
//     - 2 * SSI				     //
//     - 2 * Analog Comparator			     //
//     - 46 GPIO Pins				     //
//     - Battery-backed Hibernation Module	     //
//     - Watchdog Timer, Power saving modes,	     //
//       JTAG and Serial Wire debug		     //
//     						     //
//     						     //
//     6965 => Cortex-M3 based Microcontroller:	     //
//     - 50MHz, 256KB Flash ROM, 64KB SRAM, MPU	     //
//     - 4 Timers				     //
//     - 6 Motion Control PWM			     //
//     - 4 Capture Compare Pins			     //
//     - Ethernet MAC + PHY			     //
//     - 3 * UART				     //
//     - 2 * I2C				     //
//     - 1 * SSI				     //
//     - 2 * QEI				     //
//     - 4 * 10-bit ADC				     //
//     - Temperature Sensor			     //
//     - 2 * Analog Comparator			     //
//     - 42 GPIO Pins				     //
//     - Battery-backed Hibernation Module	     //
//     - Watchdog Timer, Power saving modes,	     //
//       JTAG and Serial Wire debug		     //
//     						     //
///////////////////////////////////////////////////////
//
//    KEEP FREE OF LIBC DEPENDENCY !!!!
//#include <stdio.h>
//#include <stdarg.h> 
//#include <string.h>
//#include <stdlib.h>
//
//
//
// Notes: When using a makefile we need to know where the Stellaris library is located
//
//            STELLARISWARE=/home/neon/etc/TI/Luminary/StellarisWare/9453
//        
//        With STELLARISWARE defined additional path info is needed. So I use
//        #include "inc/xyz.h" and #include "driverlib/xxyyzz.h"
//
#include "inc/lm3s6965.h" 
//#include "lm3s6911.h" 

//#include "inc/hw_ssi.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "inc/hw_ints.h"
//#include "inc/hw_ethernet.h"
//#include "hw_sysctl.h"


#include "driverlib/sysctl.h"
//#include "driverlib/adc.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/ssi.h"
//#include "driverlib/flash.h"
#include "driverlib/uart.h"
//#include "driverlib/ethernet.h"
//#include "driverlib/watchdog.h"
//#include "driverlib/systick.h"

#include "lm3s6965-uart.h"




//////////////////////////////////////////////////////////////////////////////// UART
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////// select a baud rate
// #define BAUD_RATE 9600
// #define BAUD_RATE 38400
// #define BAUD_RATE 115200



// Enable UART0
static void init_UART0(int baud_rate, int irda){
  SysCtlPeripheralEnable(SYSCTL_PERIPH_UART0);
  SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);  // PA0->U0RX, PA1->U0TX
  GPIOPinTypeUART(GPIO_PORTA_BASE, GPIO_PIN_0 | GPIO_PIN_1);
  UARTConfigSetExpClk(UART0_BASE, SysCtlClockGet(), baud_rate, (UART_CONFIG_WLEN_8 | UART_CONFIG_STOP_ONE | UART_CONFIG_PAR_NONE));
  //                                                ^^^^^^^^^
  //                                                   |
  //                                                   +-- this change impacts the other 2 uarts if used,
  //                                                       or all 3 uarts use the same baud rate
  //
  UARTDisable(UART0_BASE);
  if(irda) UARTEnableSIR(UART0_BASE,(tBoolean) false); // IrDA
  while(UARTCharsAvail(UART0_BASE)) UARTCharGet(UART0_BASE); // drain the FIFO
  UARTEnable(UART0_BASE);
  UARTIntEnable(UART0_BASE, UART_INT_RX | UART_INT_RT);
}


// Enable UART1
static void init_UART1(int baud_rate, int irda){
  SysCtlPeripheralEnable(SYSCTL_PERIPH_UART1);
  SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);  // PD2->U1RX, PD3->U1TX 
  GPIOPinTypeUART(GPIO_PORTD_BASE, GPIO_PIN_2 | GPIO_PIN_3);
  UARTConfigSetExpClk(UART1_BASE, SysCtlClockGet(), baud_rate, (UART_CONFIG_WLEN_8 | UART_CONFIG_STOP_ONE | UART_CONFIG_PAR_NONE));
  //                                                ^^^^^^^^^
  UARTDisable(UART1_BASE);
  if(irda) UARTEnableSIR(UART1_BASE,(tBoolean) false); // IrDA
  while(UARTCharsAvail(UART1_BASE)) UARTCharGet(UART1_BASE); // drain the FIFO
  UARTEnable(UART1_BASE);
  UARTIntEnable(UART1_BASE, UART_INT_RX | UART_INT_RT);
}

// Enable UART2
static void init_UART2(int baud_rate, int irda){
  SysCtlPeripheralEnable(SYSCTL_PERIPH_UART2);
  SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOG);  // GD0->U2RX, GD1->U2TX
  GPIOPinTypeUART(GPIO_PORTG_BASE, GPIO_PIN_0 | GPIO_PIN_1);
  UARTConfigSetExpClk(UART2_BASE, SysCtlClockGet(), baud_rate, (UART_CONFIG_WLEN_8 | UART_CONFIG_STOP_ONE | UART_CONFIG_PAR_NONE));
  //
  UARTDisable(UART2_BASE);
  if(irda) UARTEnableSIR(UART2_BASE, (tBoolean) false); // IrDA
  while(UARTCharsAvail(UART2_BASE)) UARTCharGet(UART2_BASE); // drain the FIFO
  UARTEnable(UART2_BASE);
  UARTIntEnable(UART2_BASE, UART_INT_RX | UART_INT_RT);
}

void uC_init_UART(int uart, int baud, int irda){
  switch(uart){
  case 0: init_UART0(baud,irda); break;
  case 1: init_UART1(baud,irda); break;
  case 2: init_UART2(baud,irda); break;
  }
}

void uart_isr_enable(int uart){
  switch(uart){
  case 0: IntEnable(INT_UART0); break;
  case 1: IntEnable(INT_UART1);	break;
  case 2: IntEnable(INT_UART2); break;
  }
}


//-------------------------------------------- serial I/O
// I can't decide if I should use the NonBlocking version CharPut
// emit a single character
static void emit0(char c){UARTCharPut(UART0_BASE, c);}
static void emit1(char c){UARTCharPut(UART1_BASE, c);}
static void emit2(char c){UARTCharPut(UART2_BASE, c);}

void uC_emit(char c, int uart){
  switch(uart){
  case 0: emit0(c); break;
  case 1: emit1(c); break;
  case 2: emit2(c); break;
  }
}

// string OUTPUT
//////////////////////////////////////////////////////////////////////////////////////
static void print0(char *c){ while(*c) emit0(*c++); }
static void print1(char *c){ while(*c) emit1(*c++); }
static void print2(char *c){ while(*c) emit2(*c++); }

void uC_print(char *s, int uart){
  switch(uart){
  case 0: print0(s); break;
  case 1: print1(s); break;
  case 2: print2(s); break;
  }
}


// transulate NL to CR (!! for HYPERTERM !!)
// THIS SHOULD BE A CONFIGURATION OPTION
//
// I have been looking for this "bug" for some time !!!
// It looks like the proper method is to use \n\r in all of my console output !!!
// void print0(char *c){
//   while(*c){
//     //    if(*c == '\n') emit0('\r'); else
//       emit0(*c);
//     c++;
//   }
// }


static int write0(char* buf, int len){ int i; for(i=0;i<len;i++) emit0(buf[i]); return i; }
static int write1(char* buf, int len){ int i; for(i=0;i<len;i++) emit1(buf[i]); return i; }
static int write2(char* buf, int len){ int i; for(i=0;i<len;i++) emit2(buf[i]); return i; }

