2n39o4/dddmf/lm3s6965-uart.c
int uC_write(int uart, char* buf, int len){
  switch(uart){
  case 0 : return write0(buf,len);
  case 1 : return write1(buf,len);
  case 2 : return write2(buf,len);
  }
  return 0;
}

// these 3 functions BLOCK !!!!!!!
//
//
// static int read0(void){ while(uart0_kbhit() == 0); return uart0_getc(); }
// static int read1(void){ while(uart1_kbhit() == 0); return uart1_getc(); }
// static int read2(void){ while(uart2_kbhit() == 0); return uart2_getc(); }
// 
// int read(int uart, char* buf, int len){
//   int x;
//   int cnt;
// 
//   cnt = 0;
//   while(cnt < len){
//     switch(uart){
//     case 0 : x = read0(); break;
//     case 1 : x = read1(); break;
//     case 2 : x = read2(); break;
//     default: x = 0;
//     }
//     
//     write(uart,(char*)&x,1);
//     buf[cnt++] = x;
//     if(x == '\n'){ write(uart,"\r",1); goto done; }
//     if(x == '\r'){ write(uart,"\n",1); goto done; }
//   }
//  done:
//   buf[cnt] = 0;
//   return cnt;
// }


// character INPUT
/////////////////////////////////////////////////////////////////////////////////
// uart queues                                                                 //
/////////////////////////////////////////////////////////////////////////////////
#define QUEUE_0_SIZE 128						       //
#define QUEUE_1_SIZE 128						       //
#define QUEUE_2_SIZE 128						       //
                                                                               //
static unsigned char uq0[QUEUE_0_SIZE];                                        //
static int uq0in = 0;                                                          //
static int uq0out = 0;                                                         //
                                                                               //
static unsigned char uq1[QUEUE_1_SIZE];                                        //
static int uq1in = 0;                                                          //
static int uq1out = 0;                                                         //
                                                                               //
static unsigned char uq2[QUEUE_2_SIZE];                                        //
static int uq2in = 0;                                                          //
static int uq2out = 0;                                                         //
/////////////////////////////////////////////////////////////////////////////////
// The UART0 interrupt handler.
/////////////////////////////////////////////////////////////////////////////////
void uart0_isr(void){                                                          //
  unsigned long status;                                                        //
  int x;                                                                       //
                                                                               //
  status = UARTIntStatus(UART0_BASE, true);                                    // Get the interrrupt status.
  UARTIntClear(UART0_BASE, status);                                            // Clear the asserted interrupts.
                                                                               //
  while(UARTCharsAvail(UART0_BASE)){                                           // Loop while there are characters in the receive FIFO.
    x = (unsigned char)UARTCharGetNonBlocking(UART0_BASE);                     // fetch char into buffer
    uq0[uq0in%QUEUE_0_SIZE] = x;                                               //
    uq0in++;                                                                   // increment counter
  }                                                                            //
}                                                                              //
/////////////////////////////////////////////////////////////////////////////////

// The UART1 interrupt handler. 
/////////////////////////////////////////////////////////////////////////////////
void uart1_isr(void){                                                          //
  unsigned long status;                                                        //
  int x;
  status = UARTIntStatus(UART1_BASE, true);                                    // Get the interrrupt status.
  UARTIntClear(UART1_BASE, status);                                            // Clear the asserted interrupts.
   while(UARTCharsAvail(UART1_BASE)){                                          // Loop while there are characters in the receive FIFO.
     x = (unsigned char)UARTCharGetNonBlocking(UART1_BASE);                    // fetch char
     uq1[uq1in%QUEUE_1_SIZE] = x;                                              // fetch char into buffer
     uq1in++;                                                                  // increment counter
  }                                                                            //
}                                                                              //
/////////////////////////////////////////////////////////////////////////////////


// The UART2 interrupt handler. 
/////////////////////////////////////////////////////////////////////////////////
void uart2_isr(void){                                                          //
  unsigned long status;                                                        //
  int x;
  status = UARTIntStatus(UART2_BASE, true);                                    // Get the interrrupt status.
  UARTIntClear(UART2_BASE, status);                                            // Clear the asserted interrupts.
   while(UARTCharsAvail(UART2_BASE)){                                          // Loop while there are characters in the receive FIFO.
     x = (unsigned char)UARTCharGetNonBlocking(UART2_BASE);                    // fetch char
     uq2[uq2in%QUEUE_2_SIZE] = x;                                              // fetch char into buffer
     uq2in++;                                                                  // increment counter
  }                                                                            //
}                                                                              //
/////////////////////////////////////////////////////////////////////////////////

static int uart0_kbhit(void){ return UARTCharsAvail(UART0_BASE); }
static int uart1_kbhit(void){ return UARTCharsAvail(UART1_BASE); }
static int uart2_kbhit(void){ return UARTCharsAvail(UART2_BASE); }

