2n39o4/dddmf/lm3s6965-uart.c
int uC_kbhit(int uart){
  switch(uart){
  case 0: return uart0_kbhit();
  case 1: return uart1_kbhit();
  case 2: return uart2_kbhit();
  }
  return 0;
}

static int uart0_getc(void){ return UARTCharGetNonBlocking(UART0_BASE); }
static int uart1_getc(void){ return UARTCharGetNonBlocking(UART1_BASE); }
static int uart2_getc(void){ return UARTCharGetNonBlocking(UART2_BASE); }

int uC_getc(int uart){
  switch(uart){
  case 0: return uart0_getc();
  case 1: return uart1_getc();
  case 2: return uart2_getc();
  }
  return 0;
}



// Currently gets0 returns on NL or CR, but does not save the NL or CR in
// tib.  We simply return. So it seems it should be the CLI that issues CR
// to HYPERTERM

// control = 0 -- echo character
//          -1 -- hide character with *
//          -2 -- show nothing

char* uC_fgets(char *s, int size, int uart){
  int x;
  int n;

  n = 0;
  while(1){
    while(uC_kbhit(uart)==0);
    x = uC_getc(uart);
    if(x == '\n'){ s[n] = 0x00; goto done; }  // return on NL    
    if(x == '\r'){ s[n] = 0x00; goto done; }  // return on CR
    if(x == '\b' || x == 127){
      if(n>0){
	uC_emit('\b',uart);
	uC_emit(' ',uart);
	uC_emit('\b',uart);
	n--;
      }
      continue;
    }
    if(n < size-1) s[n++] = x; // place char into buffer
    uC_emit(x,uart);           // echo character placed into buffer
    if(n == size-1){ s[n] = 0; goto done; }
  }
 done:
  return s;
}

static int _console_ = -1;

// !!!! I could get in trouble here if I select a "console" that has not been initialized
// 
void uC_set_console(int x){
  switch(x){
  case 0: _console_ = 0; break;
  case 1: _console_ = 1; break;
  case 2: _console_ = 2; break;
  }
}


#include <stdarg.h>




//*****************************************************************************
//
//! A simple UART based printf function supporting \%c, \%d, \%p, \%s, \%u,
//! \%x, and \%X.
//!
//! \param pcString is the format string.
//! \param ... are the optional arguments, which depend on the contents of the
//! format string.
//!
//! This function is very similar to the C library <tt>fprintf()</tt> function.
//! All of its output will be sent to the UART.  Only the following formatting
//! characters are supported:
//!
//! - \%c to print a character
//! - \%d or \%i to print a decimal value
//! - \%s to print a string
//! - \%u to print an unsigned decimal value
//! - \%x to print a hexadecimal value using lower case letters
//! - \%X to print a hexadecimal value using lower case letters (not upper case
//! letters as would typically be used)
//! - \%p to print a pointer as a hexadecimal value
//! - \%\% to print out a \% character
//!
//! For \%s, \%d, \%i, \%u, \%p, \%x, and \%X, an optional number may reside
//! between the \% and the format character, which specifies the minimum number
//! of characters to use for that value; if preceded by a 0 then the extra
//! characters will be filled with zeros instead of spaces.  For example,
//! ``\%8d'' will use eight characters to print the decimal value with spaces
//! added to reach eight; ``\%08d'' will use eight characters as well but will
//! add zeroes instead of spaces.
//!
//! The type of the arguments after \e pcString must match the requirements of
//! the format string.  For example, if an integer was passed where a string
//! was expected, an error of some kind will most likely occur.
//!
//! \return None.
//
//*****************************************************************************

static const char * const g_pcHex = "0123456789abcdef";

void uC_printf(const char *pcString, ...){
  unsigned long ulIdx, ulValue, ulPos, ulCount, ulBase, ulNeg;
  char *pcStr, pcBuf[16], cFill;
  va_list vaArgP;


  // Start the varargs processing.
  //
  va_start(vaArgP, pcString);


  // Loop while there are more characters in the string.
  //
  while(*pcString){
    // Find the first non-% character, or the end of the string.
    //
    for(ulIdx = 0; (pcString[ulIdx] != '%') && (pcString[ulIdx] != '\0');
	ulIdx++)
      {
      }

    //
    // Write this portion of the string.
    //
    uC_write(_console_,pcString, ulIdx);

    //
    // Skip the portion of the string that was written.
    //
    pcString += ulIdx;

    //
    // See if the next character is a %.
    //
    if(*pcString == '%'){
      //
      // Skip the %.
      //
      pcString++;

      //
      // Set the digit count to zero, and the fill character to space
      // (i.e. to the defaults).
      //
      ulCount = 0;
      cFill = ' ';
      
      //
      // It may be necessary to get back here to process more characters.
      // Goto's aren't pretty, but effective.  I feel extremely dirty for
      // using not one but two of the beasts.
      //
    again:

      //
      // Determine how to handle the next character.
      //
      switch(*pcString++){
	//
	// Handle the digit characters.
	//
      case '0':
      case '1':
      case '2':
      case '3':
      case '4':
      case '5':
      case '6':
      case '7':
      case '8':
      case '9':
	{
	  //
	  // If this is a zero, and it is the first digit, then the
	  // fill character is a zero instead of a space.
	  //
	  if((pcString[-1] == '0') && (ulCount == 0))
	    {
	      cFill = '0';
	    }

	  //
	  // Update the digit count.
	  //
	  ulCount *= 10;
	  ulCount += pcString[-1] - '0';

	  //
	  // Get the next character.
	  //
	  goto again;
	}

	//
	// Handle the %c command.
	//
      case 'c':
	{
	  //
	  // Get the value from the varargs.
	  //
	  ulValue = va_arg(vaArgP, unsigned long);
	  
	  //
	  // Print out the character.
	  //
	  uC_write(_console_,(char *)&ulValue, 1);
	  
	  //
	  // This command has been handled.
	  //
	  break;
	}

	      //
	      // Handle the %d and %i commands.
	      //
	    case 'd':
	    case 'i':
	      {
		//
		// Get the value from the varargs.
		//
		ulValue = va_arg(vaArgP, unsigned long);

		//
		// Reset the buffer position.
		//
		ulPos = 0;

		//
		// If the value is negative, make it positive and indicate
		// that a minus sign is needed.
		//
		if((long)ulValue < 0)
		  {
		    //
		    // Make the value positive.
		    //
		    ulValue = -(long)ulValue;

		    //
		    // Indicate that the value is negative.
		    //
		    ulNeg = 1;
		  }
		else
		  {
		    //
		    // Indicate that the value is positive so that a minus
		    // sign isn't inserted.
		    //
		    ulNeg = 0;
		  }

		//
		// Set the base to 10.
		//
		ulBase = 10;

		//
		// Convert the value to ASCII.
		//
		goto convert;
	      }

	      //
	      // Handle the %s command.
	      //
	    case 's':
	      {
		//
		// Get the string pointer from the varargs.
		//
		pcStr = va_arg(vaArgP, char *);

		//
		// Determine the length of the string.
		//
		for(ulIdx = 0; pcStr[ulIdx] != '\0'; ulIdx++)
		  {
		  }

		//
		// Write the string.
		//
		uC_write(_console_,pcStr, ulIdx);

		//
		// Write any required padding spaces
		//
		if(ulCount > ulIdx)
		  {
		    ulCount -= ulIdx;
		    while(ulCount--)
		      {
			uC_write(_console_," ", 1);
		      }
		  }
		//
		// This command has been handled.
		//
		break;
	      }

	      //
	      // Handle the %u command.
	      //
	    case 'u':
	      {
		//
		// Get the value from the varargs.
		//
		ulValue = va_arg(vaArgP, unsigned long);

		//
		// Reset the buffer position.
		//
		ulPos = 0;

		//
		// Set the base to 10.
		//
		ulBase = 10;

		//
		// Indicate that the value is positive so that a minus sign
		// isn't inserted.
		//
		ulNeg = 0;

		//
		// Convert the value to ASCII.
		//
		goto convert;
	      }

	      //
	      // Handle the %x and %X commands.  Note that they are treated
	      // identically; i.e. %X will use lower case letters for a-f
	      // instead of the upper case letters is should use.  We also
	      // alias %p to %x.
	      //
	    case 'x':
	    case 'X':
	    case 'p':
	      {
		//
		// Get the value from the varargs.
		//
		ulValue = va_arg(vaArgP, unsigned long);

		//
		// Reset the buffer position.
		//
		ulPos = 0;

		//
		// Set the base to 16.
		//
		ulBase = 16;

		//
		// Indicate that the value is positive so that a minus sign
		// isn't inserted.
		//
		ulNeg = 0;

		//
		// Determine the number of digits in the string version of
		// the value.
		//
	      convert:
		for(ulIdx = 1;
		    (((ulIdx * ulBase) <= ulValue) &&
		     (((ulIdx * ulBase) / ulBase) == ulIdx));
		    ulIdx *= ulBase, ulCount--)
		  {
		  }

		//
		// If the value is negative, reduce the count of padding
		// characters needed.
		//
		if(ulNeg)
		  {
		    ulCount--;
		  }

		//
		// If the value is negative and the value is padded with
		// zeros, then place the minus sign before the padding.
		//
		if(ulNeg && (cFill == '0'))
		  {
		    //
		    // Place the minus sign in the output buffer.
		    //
		    pcBuf[ulPos++] = '-';

		    //
		    // The minus sign has been placed, so turn off the
		    // negative flag.
		    //
		    ulNeg = 0;
		  }

		//
		// Provide additional padding at the beginning of the
		// string conversion if needed.
		//
		if((ulCount > 1) && (ulCount < 16))
		  {
		    for(ulCount--; ulCount; ulCount--)
		      {
			pcBuf[ulPos++] = cFill;
		      }
		  }

		//
		// If the value is negative, then place the minus sign
		// before the number.
		//
		if(ulNeg)
		  {
		    //
		    // Place the minus sign in the output buffer.
		    //
		    pcBuf[ulPos++] = '-';
		  }

		//
		// Convert the value into a string.
		//
		for(; ulIdx; ulIdx /= ulBase)
		  {
		    pcBuf[ulPos++] = g_pcHex[(ulValue / ulIdx) % ulBase];
		  }

		//
		// Write the string.
		//
		uC_write(_console_,pcBuf, ulPos);

		//
		// This command has been handled.
		//
		break;
	      }

	      //
	      // Handle the %% command.
	      //
	    case '%':
	      {
		//
		// Simply write a single %.
		//
		uC_write(_console_,pcString - 1, 1);

		//
		// This command has been handled.
		//
		break;
	      }

	      //
	      // Handle all other commands.
	      //
	    default:
	      {
		//
		// Indicate an error.
		//
		uC_write(_console_,"ERROR", 5);

		//
		// This command has been handled.
		//
		break;
	      }
            }
        }
    }

  //
  // End the varargs processing.
  //
  va_end(vaArgP);
}
